### 데이터베이스

SQLite  
: 가볍게 파일 하나로 사용할 수 있는 DB

In [33]:
import sqlite3

In [ ]:
# sqlite 데이터베이스 연결하기
dbPath = "../Data/test.sqlite"
conn = sqlite3.connect(dbPath)

# 테이블을 생성하고 데이터 넣기
curs = conn.cursor()
# executescript는 여러개 실행할 때
# 하나라면 execute
curs.executescript(
    """
    /* items 테이블이 이미 있다면 제거하기 */
    DROP TABLE IF EXISTS items;

    /* 테이블 생성하기 */
    CREATE TABLE items(
        item_id INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT UNIQUE,
        price INTEGER
    );

    /* 데이터 넣기 */
    INSERT INTO items(name, price) VALUES ('Apple',800);
    INSERT INTO items(name, price) VALUES ('Orange',780);
    INSERT INTO items(name, price) VALUES ('Banana',430);
    """
)

# 위의 작업을 데이터베이스에 반영하기
conn.commit()
# commit 실행시 memory => 파일 저장

In [ ]:
# 데이터 추출하기
curs = conn.cursor()
curs.execute("SELECT * FROM items")
item_list = curs.fetchall()
print(item_list)
# 결과: 튜플로 저장되있음
for i in item_list:
    print(i[0],i[1],i[2])

In [120]:
filePath = "../Data/test2.sqlite"
conn = sqlite3.connect(filePath)

# 테이블 생성하기
curs = conn.cursor()
curs.execute("DROP TABLE IF EXISTS items")
curs.execute(
    """
    CREATE TABLE items(
        item_id INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT UNIQUE,
        price INTEGER
    );
    """
)
conn.commit()

In [ ]:
# 데이터 넣기 (다른 곳에서 데이터 받아서 넣을 때)
curs = conn.cursor()
curs.execute("INSERT INTO items (name, price) VALUES (?,?)",("Orange",5200))
conn.commit()

In [ ]:
curs = conn.cursor()
curs.execute("SELECT * FROM items")
item_list = curs.fetchall()
print(item_list)
# 결과: 튜플로 저장되있음
for i in item_list:
    print(i[0],i[1])

In [ ]:
# 여러 데이터를 연속으로 넣기
curs = conn.cursor()
# 데이터부터 만듬 (여러 데이터)
data = [("Mango",7700),("Kiwi",4000),("Peach",9400),("Persimmon",7000),("Banana",4000)]
curs.executemany("INSERT INTO items(name,price) VALUES (?,?)", data)
conn.commit()

In [41]:
curs.execute("SELECT * FROM items")
item_list = curs.fetchall()
print(item_list)
# 결과: 튜플로 저장되있음
for i in item_list:
    print(i[0],i[1])

[(1, 'Mango', 7700), (2, 'Kiwi', 4000), (3, 'Peach', 9400), (4, 'Persimmon', 7000), (5, 'Banana', 4000)]
1 Mango
2 Kiwi
3 Peach
4 Persimmon
5 Banana

In [42]:
# 4000~7000원 사이의 데이터 추출하기
curs = conn.cursor()
curs.execute("SELECT * FROM items WHERE price >= ? and price <= ?",("4000","7000"))
selected_item_list = curs.fetchall()
print(selected_item_list)
# 결과: 튜플로 저장되있음
for i in selected_item_list:
    print(i[0],i[1])

[(2, 'Kiwi', 4000), (4, 'Persimmon', 7000), (5, 'Banana', 4000)]
2 Kiwi
4 Persimmon
5 Banana

---
### MySQL

In [43]:
# !pip install pymysql

Defaulting to user installation because normal site-packages is not writeable
Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 43.8/43.8 kB 1.2 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

---
### 프로젝트: Flutter-Python Server (RestAPI)-Database
---

In [44]:
import pymysql

In [121]:
# Connection
conn = pymysql.connect(
    host = "127.0.0.1",
    user = "root",
    password = "qwer1234",
    db = "education",
    charset = "utf8"
)

In [53]:
# Cursor
curs = conn.cursor()

In [54]:
sql = "select * from student"
curs.execute(sql)
rows = curs.fetchall()
row_list = list(rows)
print(row_list)

[('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9011', None)]

In [58]:
print(row_list[0])
print(row_list[0][1])

('S001', '박소명', '컴퓨터공학과', '123-4567', None)
박소명

In [75]:
# Insert
sql = "insert into student(scode,sname,sdept,sphone,saddress) values(%s,%s,%s,%s,%s)"

In [76]:
curs.execute(sql,("b001","유비","국문학과","010-1111","서울"))
curs.execute(sql,("b002","관우","심리학과","010-2222","서울"))
curs.execute(sql,("b003","장비","경제학과","010-3333","서울"))
conn.commit()

In [62]:
sql = "select * from student"
curs.execute(sql)
rows = curs.fetchall()
print(rows)

(('b001', '유비', '국문학과', '010-1111', '서울'), ('b002', '관우', '심리학과', '010-2222', '서울'), ('b003', '장비', '경제학과', '010-3333', '서울'), ('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9011', None))

In [ ]:
conn.close()

In [72]:
# Insert 여러줄
dbPath = "../Data/test.sqlite"
conn = sqlite3.connect(dbPath)
conn = pymysql.connect(
    host = "127.0.0.1",
    user = "root",
    password = "qwer1234",
    db = "education",
    charset = "utf8"
)
data = (
    ('c001','조조','국문학과','016-111','경기'),
    ('c002','여포','국문학과','016-222','경기'),
    ('c003','손견','국문학과','016-333','경기'),
)
sql = "insert into student(scode,sname,sdept,sphone,saddress) values(%s,%s,%s,%s,%s)"

In [73]:
curs = conn.cursor()
curs.executemany(sql,data)
conn.commit()

In [77]:
sql = "select * from student"
curs.execute(sql)
rows = curs.fetchall()
print(rows)

(('b001', '유비', '국문학과', '010-1111', '서울'), ('b002', '관우', '심리학과', '010-2222', '서울'), ('b003', '장비', '경제학과', '010-3333', '서울'), ('c001', '조조', '국문학과', '016-111', '경기'), ('c002', '여포', '국문학과', '016-222', '경기'), ('c003', '손견', '국문학과', '016-333', '경기'), ('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9011', None))

In [78]:
conn.close()

---
### select내용을 df로 보기

In [79]:
# !pip install sqlalchemy

Defaulting to user installation because normal site-packages is not writeable
Collecting sqlalchemy
  Downloading SQLAlchemy-1.4.46.tar.gz (8.5 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 8.5/8.5 MB 2.7 MB/s eta 0:00:0000:0100:01
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: sqlalchemy
  Building wheel for sqlalchemy (setup.py) ... done
  Created wheel for sqlalchemy: filename=SQLAlchemy-1.4.46-cp39-cp39-macosx_11_0_arm64.whl size=1561265 sha256=fa4c6a48f68c69b2a97be3394c24574278098a605bff00ffd9b64cd6b9f8df8c
  Stored in directory: /Users/ethan/Library/Caches/pip/wheels/2e/7a/c5/c4adc0fde658e83ef6ece76c8a7f115fc378c85774d9e5fd42
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-1.4.46

In [80]:
import pandas as pd
from sqlalchemy import create_engine

In [81]:
# mysql이 pymysql과 연결되어있고 아이디, 비밀번호, 아이피, 포트, 스키마 정보는 이러하다~
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/education")
conn = engine.connect()

In [83]:
data = pd.read_sql_table('student',conn)
data

   scode sname   sdept    sphone saddress
0   b001    유비    국문학과  010-1111       서울
1   b002    관우    심리학과  010-2222       서울
2   b003    장비    경제학과  010-3333       서울
3   c001    조조    국문학과   016-111       경기
4   c002    여포    국문학과   016-222       경기
5   c003    손견    국문학과   016-333       경기
6   S001   박소명  컴퓨터공학과  123-4567     None
7   S002   최민국  컴퓨터공학과  234-5678     None
8   S003   이승호    국문학과  345-6789     None
9   S004   정수봉    국문학과  456-7890     None
10  S005   김상진     사학과  567-8901     None
11  S006   황정숙     사학과  678-9011     None

In [84]:
conn.close()

### Dataframe을 Database로 Insert
- DaumList.csv 파일을 DB에 넣기

In [88]:
movies = pd.read_csv("../Data/DaumList.csv")
# 현재 df컬럼은 index, title; db컬럼은 seq, rank, title임
# 새 컬럼명 지정
column = ['rank','title']
movies.columns = column
movies.head

<bound method NDFrame.head of     rank                     title
0      1                 아바타: 물의 길
1      2                더 퍼스트 슬램덩크
2      3                        영웅
3      4         장화신은 고양이: 끝내주는 모험
4      5                       스위치
5      6  오늘 밤, 세계에서 이 사랑이 사라진다 해도
6      7                       올빼미
7      8   신비아파트 극장판 차원도깨비와 7개의 세계
8      9                    프린스 챠밍
9     10                        유령
10    11                3000년의 기다림
11    12                        문맨
12    13                       젠틀맨
13    14                시간을 꿈꾸는 소녀
14    15                  웃는남자 감독판>

In [89]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/daum")
conn = engine.connect()

In [90]:
movies.to_sql(name = 'movie',con=engine,if_exists='append',index=False)

15

In [92]:
data = pd.read_sql_table('movie',conn)
data

    seq  rank                     title
0     1     1                 아바타: 물의 길
1     2     2                더 퍼스트 슬램덩크
2     3     3                        영웅
3     4     4         장화신은 고양이: 끝내주는 모험
4     5     5                       스위치
5     6     6  오늘 밤, 세계에서 이 사랑이 사라진다 해도
6     7     7                       올빼미
7     8     8   신비아파트 극장판 차원도깨비와 7개의 세계
8     9     9                    프린스 챠밍
9    10    10                        유령
10   11    11                3000년의 기다림
11   12    12                        문맨
12   13    13                       젠틀맨
13   14    14                시간을 꿈꾸는 소녀
14   15    15                  웃는남자 감독판

---
### TinyDB
- NoSQL 문서형 데이터베이스 (like Firebase)
- MongoDB가 대표적이지만 MongoDB는 설치가 필요하고, TinyDB는 패키지만 설치하면 됨

In [93]:
# !pip install tinydb

Defaulting to user installation because normal site-packages is not writeable
Collecting tinydb
  Downloading tinydb-4.7.1-py3-none-any.whl (24 kB)
Installing collected packages: tinydb
Successfully installed tinydb-4.7.1

In [94]:
# TinyDB를 사용하기 위한 라이브러리 불러오기
from tinydb import TinyDB, Query, where

In [96]:
# 데이터베이스 연결하기 (문서형이므로 file, json형식으로)
filePath = "../Data/tinydb.json"
db = TinyDB(filePath)

In [97]:
# 기존 테이블이 있다면 제거하기
db.drop_table("fruits")

In [98]:
# 테이블 생성하기
table = db.table("fruits")

In [99]:
# 테이블에 데이터 추가하기
table.insert({'name':'Banana','price':6000})
# 결과: {"fruits": {"1": {"name": "Banana", "price": 6000}}}

1

In [100]:
table.insert({'name':'Orange','price':12000})
table.insert({'name':'Mango','price':8400})
# 결과: "2": {"name": "Orange", "price": 12000}, "3": {"name": "Mango", "price": 8400}}}

3

In [101]:
# 모든 데이터 출력
print(table.all())
# [{'name': 'Banana', 'price': 6000}, {'name': 'Orange', 'price': 12000}, {'name': 'Mango', 'price': 8400}]

[{'name': 'Banana', 'price': 6000}, {'name': 'Orange', 'price': 12000}, {'name': 'Mango', 'price': 8400}]

In [104]:
# Orange 검색
item = Query()
res = table.search(item.name=='Orange')
print(res)
# print(res['price'])
print(res[0]['price'])

[{'name': 'Orange', 'price': 12000}]
12000

In [115]:
# 가격이 8000원 이상인 과일명만 추출하기
item = Query()
res = table.search(item.price>=8000)
for i in range(0,2):
    print('-',res[i]['name'])

- Orange
- Mango

In [117]:
# 수정하기
table.update({'price':84000},item.name=="Mango")
res = table.search(item.name == "Mango")
print(res)

[{'name': 'Mango', 'price': 84000}]

In [119]:
# 삭제하기 #1
table.remove(where('name')=="Mango")
# 삭제하기 #2
table.remove(item.name == "Orange")
print(table.all())

[{'name': 'Banana', 'price': 6000}]